module.exports = {
    welcome: 'Добро пожаловать! Выберите действие:',
    postingWelcome: 'Управление постингом:',
    createPost: 'Напишите или отправьте свой пост:',
    myChannels: 'Здесь вы можете управлять вашими каналами.',
    addChannel: 'Добавьте бота в ваш канал.',
    manageChannel: 'Канал - <channelName>',
    calendar: 'Выберете канал для просмотра отложенных публикаций.',
    calendarPosts: 'Список запланированных публикаций.\n\nНажмите на пост, чтобы отредактировать его.',
    mailingInDevelopment: 'Функционал рассылки пока в разработке.',
    editTextPost: 'Введите новый текст:',
    editMediaPost: 'Пришлите новое медиа:',
    editUrlPost: 'Введите названия и ссылки для ваших кнопок в формате [название1]|[ссылка1]~[название2]|[ссылка2].\nПример:\nКнопка1|https://example.com\nКнопка2|https://example.com~Кнопка3|https://example.com',
    editReactionsPost: 'Введите названия для кнопок реакций через \'-\'\nПример:\n👍-👎\n😐\nреакция текстом-еще одна реакция-😎',
    editSecretPost: 'Введите название кнопки скрытого продолжения:',
    editSecret2Post: 'Введите текст, отображаемый неподписанным пользователям:',
    editSecret3Post: 'А теперь введите текст, отображаемый подписанным пользователям:',
    selectChannels: 'Выберите каналы для постинга\nВыбранные каналы:',
    settingAutodelete: 'Выберите время автоудаления поста строго в формате DD.MM.YYYY HH:mm\nПример:\n02.09.2024 17.00\n15.02.2024 06:05',
    settingTimer: 'Выберите время отложенной отправки поста строго в формате DD.MM.YYYY HH:mm\nПример:\n02.09.2024 17.00\n15.02.2024 06:05',
    postSended: 'Ваш пост готов.',
    submitPost: 'Настройте отправку поста.'
  };
  